<a href="https://colab.research.google.com/github/Mr-Stark-18/SOC2k21-Project/blob/Python-Course/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Series

In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [ ]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d= {'a':10,'b':20,'c':30}

In [ ]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [ ]:
pd.Series(data=my_data,index= labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [ ]:
ser1 = pd.Series([1,2,3,4],['USA','India','Ireland','Russia'])

In [ ]:
ser1

USA        1
India      2
Ireland    3
Russia     4
dtype: int64

In [ ]:
ser2 = pd.Series([1,2,6,7],['India','Norway','Mexico','Germany'])

In [ ]:
ser2

India      1
Norway     2
Mexico     6
Germany    7
dtype: int64

In [ ]:
ser3 = pd.Series(data=labels)

In [ ]:
ser3[0]

'a'

In [ ]:
ser1 + ser2

Germany    NaN
India      3.0
Ireland    NaN
Mexico     NaN
Norway     NaN
Russia     NaN
USA        NaN
dtype: float64

#DataFrames

In [ ]:
from numpy.random import randn

In [ ]:
np.random.seed(101)

In [ ]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [ ]:
type(df['W'])

pandas.core.series.Series

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [ ]:
df['new'] = df['Z']

In [ ]:
df['new']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: new, dtype: float64

In [ ]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  0.503826
B  0.651118 -0.319318 -0.848077  0.605965  0.605965
C -2.018168  0.740122  0.528813 -0.589001 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057  0.955057
E  0.190794  1.978757  2.605967  0.683509  0.683509

In [ ]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  0.503826
B  0.651118 -0.319318 -0.848077  0.605965  0.605965
C -2.018168  0.740122  0.528813 -0.589001 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057  0.955057
E  0.190794  1.978757  2.605967  0.683509  0.683509

In [ ]:
df.drop('new',axis=1,inplace=True)

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.shape

(5, 4)

In [ ]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [ ]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [ ]:
df.loc['B','Z']

0.6059653494949336

In [ ]:
df.loc['B':,:'Y']

          W         X         Y
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

- DataFrame Part 2

In [ ]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [ ]:
booldf = df>0

In [ ]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df<3]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[df>-0.5]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
resultdf = df[df['Y']>0]

In [ ]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
resultdf['Y']

A    0.907969
C    0.528813
E    2.605967
Name: Y, dtype: float64

In [ ]:
resultdf.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

- to display rows as series use the .loc command

In [ ]:
df[df['Z']<0][['X','Y']]

          X         Y
C  0.740122  0.528813

In [ ]:
df[df['Y']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df[(df['Y']>0)&(df['Z']<0)]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [ ]:
True or False

True

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
newind = 'CA NY WY OR CO'.split()

In [ ]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [ ]:
df['States']=newind

In [ ]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [ ]:
df.set_index('States',inplace=True)

In [ ]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

- DataFrames Part 3

In [ ]:
#indexlevels
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [ ]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [ ]:
inside

[1, 2, 3, 1, 2, 3]

In [ ]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [ ]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [ ]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [ ]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [ ]:
df['A']

G1  1    0.302665
    2   -1.706086
    3   -0.134841
G2  1    0.166905
    2    0.807706
    3    0.638787
Name: A, dtype: float64

In [ ]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [ ]:
df.index.names= ['Groups','Num']

In [ ]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [ ]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [ ]:
df.loc['G1'].loc[3]['A']

-0.13484072060601238

In [ ]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [ ]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

#Missing Data

In [ ]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [ ]:
df= pd.DataFrame(d)

In [ ]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [ ]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [ ]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [ ]:
df.fillna(value = 4)

     A    B  C
0  1.0  5.0  1
1  2.0  4.0  2
2  4.0  4.0  3

In [ ]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

#GroupBy

In [ ]:
data = {'Company':'GOOG GOOG MSFT MSFT FB FB'.split(),'Person':'Sam Charlie Amy Vanesa Carl Sarah'.split(),
        'Sales':[200,120,340,124,243,350]}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df
df.drop('Person',axis=1,inplace=True)

In [ ]:
objgoup=df.groupby('Company')

In [ ]:
objgoup

In [ ]:
df

  Company  Sales
0    GOOG    200
1    GOOG    120
2    MSFT    340
3    MSFT    124
4      FB    243
5      FB    350

In [ ]:
df['Person']='Sam Charlie Amy Vanessa Carl Sarah'.split()

In [ ]:
df

  Company  Sales   Person
0    GOOG    200      Sam
1    GOOG    120  Charlie
2    MSFT    340      Amy
3    MSFT    124  Vanessa
4      FB    243     Carl
5      FB    350    Sarah

In [ ]:
bycomp= df.groupby('Company')

In [ ]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [ ]:
type(df['Sales'])

pandas.core.series.Series

In [ ]:
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [ ]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [ ]:
df.groupby('Company').sum().loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

In [ ]:
df.groupby('Company').count()

         Sales  Person
Company
FB           2       2
GOOG         2       2
MSFT         2       2

In [ ]:
df.groupby('Company').max().loc['FB']

Sales       350
Person    Sarah
Name: FB, dtype: object

In [ ]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

#Merging Joining Concatenation

#operations

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':'abc def ghi xyz'.split()})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df['col2'].unique()

array([444, 555, 666])

In [ ]:
len(df['col2'].unique())

3

In [ ]:
df['col2'].nunique()

3

In [ ]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [ ]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [ ]:
def times2(x):
  return x*2

In [ ]:
df['col1'].sum()

10

In [ ]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [ ]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [ ]:
df['col1'].apply(lambda x:x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [ ]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [ ]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df.sort_values('col3')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [ ]:
data = {'A':'IITB IITD IITB IITD IITB IITD'.split(),
        'B':'three two three two three two'.split(),
        'D':[1,3,2,5,4,1]}
df= pd.DataFrame(data)

In [ ]:
df

      A      B  D
0  IITB  three  1
1  IITD    two  3
2  IITB  three  2
3  IITD    two  5
4  IITB  three  4
5  IITD    two  1

In [ ]:
df['C']='x y x y x y'.split()

In [ ]:
df=df[['A','B','C','D']]
df

      A      B  C  D
0  IITB  three  x  1
1  IITD    two  y  3
2  IITB  three  x  2
3  IITD    two  y  5
4  IITB  three  x  4
5  IITD    two  y  1

In [ ]:
df.pivot_table(values='D',index= ['A','B'],columns=['C'])

C                  x    y
A    B
IITB three  2.333333  NaN
IITD two         NaN  3.0

#Data Input and output
- CSV

In [ ]:
pwd

'/content'

In [ ]:
cd /var

/var

In [ ]:
pwd

'/var'

In [ ]:
pd.read_csv('/example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
df = pd.read_csv('/example')

In [ ]:
df.to_csv('My_output',index=False)

In [ ]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
pwd

'/var'

- when importing exel files it can only import data not formulas and pictures

In [ ]:
pip install xlrd

Requirement already satisfied: xlrd in /usr/local/lib/python3.7/dist-packages (1.1.0)

In [ ]:
pd.read_excel('/Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [ ]:
df.to_excel('Excel_sample.xlsx', sheet_name='newsheet')

In [ ]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [ ]:
data

[                             Bank Name  ...       Closing Date
 0                    Almena State Bank  ...   October 23, 2020
 1           First City Bank of Florida  ...   October 16, 2020
 2                 The First State Bank  ...      April 3, 2020
 3                   Ericson State Bank  ...  February 14, 2020
 4     City National Bank of New Jersey  ...   November 1, 2019
 ..                                 ...  ...                ...
 558                 Superior Bank, FSB  ...      July 27, 2001
 559                Malta National Bank  ...        May 3, 2001
 560    First Alliance Bank & Trust Co.  ...   February 2, 2001
 561  National State Bank of Metropolis  ...  December 14, 2000
 562                   Bank of Honolulu  ...   October 13, 2000

 [563 rows x 6 columns]]

In [ ]:
type(data)

list

In [ ]:
data[0].head()

                          Bank Name  ...       Closing Date
0                 Almena State Bank  ...   October 23, 2020
1        First City Bank of Florida  ...   October 16, 2020
2              The First State Bank  ...      April 3, 2020
3                Ericson State Bank  ...  February 14, 2020
4  City National Bank of New Jersey  ...   November 1, 2019

[5 rows x 6 columns]

In [ ]:
data = pd.read_html('/Corona Data.html')

ValueError: ignored

In [ ]:
from sqlalchemy import create_engine

In [ ]:
engine = create_engine('sqlite:///:memory:')

In [ ]:
df.to_sql('My_table',engine)

In [ ]:
sqldf = pd.read_sql('My_table',con= engine)

In [ ]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15